In [1]:
import pandas as pd
import numpy as np

In [3]:
data= pd.read_excel("rptUbigeo.xls")

In [4]:
data.head()

,Unnamed: 0,Unnamed: 1,CÓDIGOS DE UBICACIÓN GEOGRÁFICA,Unnamed: 3,Unnamed: 4,Unnamed: 5
0,NaN,DEPARTAMENTO,NaN,NaN,PROVINCIA,DISTRITO
1,NaN,01 Amazonas,NaN,NaN,,
2,NaN,01 Amazonas,NaN,NaN,01 Chachapoyas,
3,NaN,01 Amazonas,NaN,NaN,01 Chachapoyas,01 Chachapoyas
4,NaN,01 Amazonas,NaN,NaN,01 Chachapoyas,02 Asunción

In [6]:
list(data)

['Unnamed: 0',
 'Unnamed: 1',
 'CÓDIGOS DE UBICACIÓN GEOGRÁFICA',
 'Unnamed: 3',
 'Unnamed: 4',
 'Unnamed: 5']

In [7]:
data=data.drop(['Unnamed: 0'], axis=1)
data=data.drop(['CÓDIGOS DE UBICACIÓN GEOGRÁFICA'], axis=1)
data=data.drop(['Unnamed: 3'], axis=1)

In [8]:
data.head()

     Unnamed: 1      Unnamed: 4      Unnamed: 5
0  DEPARTAMENTO       PROVINCIA        DISTRITO
1   01 Amazonas
2   01 Amazonas  01 Chachapoyas
3   01 Amazonas  01 Chachapoyas  01 Chachapoyas
4   01 Amazonas  01 Chachapoyas     02 Asunción

In [9]:
data.columns=['departamento','provincia','distrito']

In [10]:
data.head()

   departamento       provincia        distrito
0  DEPARTAMENTO       PROVINCIA        DISTRITO
1   01 Amazonas
2   01 Amazonas  01 Chachapoyas
3   01 Amazonas  01 Chachapoyas  01 Chachapoyas
4   01 Amazonas  01 Chachapoyas     02 Asunción

In [12]:
data=data.drop([0,1],axis=0)

In [13]:
data.head()

  departamento       provincia        distrito
2  01 Amazonas  01 Chachapoyas
3  01 Amazonas  01 Chachapoyas  01 Chachapoyas
4  01 Amazonas  01 Chachapoyas     02 Asunción
5  01 Amazonas  01 Chachapoyas       03 Balsas
6  01 Amazonas  01 Chachapoyas        04 Cheto

In [16]:
data=data.dropna()

In [17]:
data.head()

  departamento       provincia        distrito
2  01 Amazonas  01 Chachapoyas
3  01 Amazonas  01 Chachapoyas  01 Chachapoyas
4  01 Amazonas  01 Chachapoyas     02 Asunción
5  01 Amazonas  01 Chachapoyas       03 Balsas
6  01 Amazonas  01 Chachapoyas        04 Cheto

In [21]:
data=data.drop(data[data['distrito']==' '].index)

In [22]:
data.head()

  departamento       provincia        distrito
3  01 Amazonas  01 Chachapoyas  01 Chachapoyas
4  01 Amazonas  01 Chachapoyas     02 Asunción
5  01 Amazonas  01 Chachapoyas       03 Balsas
6  01 Amazonas  01 Chachapoyas        04 Cheto
7  01 Amazonas  01 Chachapoyas    05 Chiliquin

In [25]:
#ENCONTRAMOS UN PATRÓN QUE TODOS LAS CELDAS TIENEN QUE BORRRARSE LOS PRIMEROS 3 CARÁCTERES

In [26]:
data['distrito']= data['distrito'].map(lambda x: str(x)[3:])
data['departamento']= data['departamento'].map(lambda x: str(x)[3:])
data['provincia']= data['provincia'].map(lambda x: str(x)[3:])

In [27]:
data.head()

  departamento    provincia     distrito
3     Amazonas  Chachapoyas  Chachapoyas
4     Amazonas  Chachapoyas     Asunción
5     Amazonas  Chachapoyas       Balsas
6     Amazonas  Chachapoyas        Cheto
7     Amazonas  Chachapoyas    Chiliquin

In [31]:
data.to_csv('Departamento_Provincia_Distrito_Peru', index = False)

In [32]:
dataTemp= pd.read_csv('Departamento_Provincia_Distrito_Peru')

In [33]:
dataTemp.head()

  departamento    provincia     distrito
0     Amazonas  Chachapoyas  Chachapoyas
1     Amazonas  Chachapoyas     Asunción
2     Amazonas  Chachapoyas       Balsas
3     Amazonas  Chachapoyas        Cheto
4     Amazonas  Chachapoyas    Chiliquin